Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: The following implementation (which is paired with the get Object Value(_: for: error Description:) example above) prefixes a two-digit float representation with a dollar sign:
ja: 以下の実装（それは上記のget Object Value(_: for: error Description:)例と１組にされます）は、２桁浮動小数点表現にドル符号の接頭辞を付けます。

source: The following method obtains a bundle by specifying its path (bundle With Path:), then loads the bundle with principal Class and uses the principal class object to allocate and initialize an instance of that class:
ja: 以下のメソッドは、あるバンドルをそれのパス（bundle With Path:）を指定することによって取得します、それからそのバンドルをprincipal Classを使ってロードします、そしてプリンシパルクラスオブジェクトを使ってそのクラスのインスタンスをアロケートおよび初期化します：

source: The following table shows how the quantity of 9 hours, 41 minutes, and 30 seconds is displayed in the U.S. English locale for each style:
ja: 以下の表は、９時間、41分、そして30秒の量が以下の各スタイルに対してU.S Englishロケールにおいてどのように表示されるかを示します。

source: The following tables describe the character expressions used by the regular expression to match patterns within a string, the pattern operators that specify how many times a pattern is matched and additional matching restrictions, and the last table specifies flags that can be included in the regular expression pattern that specify search behavior over multiple lines (these flags can also be specified using the NSRegular Expression .Options option flags.
ja: 以下の表は、ある文字列内部においてさまざまな類型（パターン）にマッチするために正規表現において使われる文字表現、どのくらい多くの回数あるパターンがマッチするかを、そして特別なマッチング制約を指定するパターン演算子を解説します、そして最後の表は正規表現パターンに含めることが出来るフラグを指定します、それは複数行にわたる検索挙動を指定します（これらのフラグはまた、NSRegular Expression .Optionsオプションフラグを使って指定されることができます）。

source: The format for day is inferred based on provided options:
ja: 日に対する書式設定は、提供されたオプションに基づいて推論されます：

source: The format for these date and time styles is not exact because they depend on the locale, user preference settings, and the operating system version.
ja: これらの日付と時刻スタイルのための書式設定は正確ではありません、なぜならそれらがロケール、ユーザ初期設定、そしてオペレーティングシステムバージョンに依存するからです。

source: The format for timezone is ZZZZZ.
ja: タイムゾーンに対する書式設定は、ZZZZZです。

source: The format for week of year is ww, including the W prefix.
ja: 年内週番号の書式設定はwwです、W接頭辞を含みます。

source: The format for year is inferred based on the other specified options.
ja: 年に対する書式設定は、他の指定オプションに基づいて推論されます。

source: The format specification allowed by these functions is that which is understood by NSString’s formatting capabilities (which is not necessarily the set of format escapes and flags understood by printf).
ja: これらの関数によって可能にされるフォーマット指定は、NSStringのもつフォーマット能力によって理解されるそれです（それは必ずしもprintfによって理解されるフォーマットエスケープとフラグではありません）。

source: The format used for internet date times, according to the RFC 3339 standard.
ja: インターネット日時に対して使われる書式設定、RFC 3339規格によります。

source: The formatter behavior for the receiver.
ja: レシーバに対するフォーマッタ挙動。

source: The formatter derives the context from the generic string’s location and then formats the string appropriately.
ja: フォーマッタは、汎用文字列の持つ場所情報から前後関係を引き出します、それから文字列を適切に書式設定します。

source: The formatter includes both from Date and to Date in the resulting string only when there is enough of a difference in their values to warrant the inclusion of both.
ja: フォーマッタは、両方を含める理由となる十分な差がある場合にのみ、from Dateとto Dateの両方を結果文字列に含みます。

source: The formatter object has many options for creating both abbreviated and expanded strings.
ja: フォーマッタオブジェクトは、短縮および伸長文字列の両方を作成するために多くのオプションを持っています。

source: The formatter style.
ja: フォーマッタ形式。

source: The formatter takes the current user’s locale and language into account when generating strings.
ja: フォーマッタは、文字列を生成するとき現在のユーザのロケールと言語を考慮に入れます。

source: The formatter uses locale and language information, along with custom formatting options, to define the content of the resulting string.
ja: フォーマッタは、ロケールと言語情報、それだけでなくあつらえの書式設定オプションも使って、結果文字列の内容を定義します。

source: The formatter uses the calendar in this property to format values that do not have an inherent calendar of their own.
ja: フォーマッタは、カレンダーをこのプロパティにおいて使って、それら自身の内在カレンダーを持たない値それらを書式設定します。

source: The formatting context allows the formatter to apply appropriate capitalization depending on how the how the string will be used, and whether the locale makes capitalization distinctions.
ja: 書式設定文脈は、どのように文字列が使われるか、そしてロケールが頭文字指定を識別するか次第で、フォーマッタに適切な頭文字指定を適用させます。

source: The formatting strategies available for formatting dates when encoding a date as JSON.
ja: 日付をJSONとしてエンコードする場合に日付を書式設定するのに利用可能な書式設定戦略。

source: The formatting style for unit names.
ja: 単位名に対する書式設定スタイル。

source: The formatting style for units whose value is 0.
ja: 値がゼロである単位に対する書式設定スタイル。

source: The forwarding object is, in a sense, able to “inherit” some of the characteristics of the object it forwards the message to.
ja: 転送先のオブジェクトは、ある意味では、メッセージの転送元のオブジェクトのいくつかの特徴を「継承する」ことができます。

source: The frame of the accessibility element, in screen coordinates.
ja: アクセシビリティ要素のフレーム、画面座標で。

source: The full URL of the receiver’s bundle directory.
ja: レシーバの持つバンドルディレクトリの完全URL。

source: The full absolute path of a file.
ja: あるファイルの完全な絶対パス。

source: The full pathname for the resource file or nil if the file could not be located.
ja: リソースファイルに対する完全パス名またはファイルが捜し出されることができなかったならばnil。

source: The full pathname for the resource file, or nil if the file could not be located.
ja: リソースファイルの完全パス名、またはファイルが捜し出されることができなかったならばnil。

source: The full pathname of the bundle’s subdirectory containing private frameworks.
ja: プライベートフレームワークを含んでいる、バンドルの持つ下位ディレクトリの完全パス名。

source: The full pathname of the bundle’s subdirectory containing resources.
ja: リソースを含んでいる、バンドルの持つ下位ディレクトリの完全パス名。

source: The full pathname of the bundle’s subdirectory containing shared frameworks.
ja: 共有フレームワークを含んでいる、バンドルの持つ下位ディレクトリの完全パス名。

source: The full pathname of the bundle’s subdirectory containing shared support files.
ja: 共有サポートファイルを含んでいる、バンドルの持つ下位ディレクトリのファイルURL。

source: The full pathname of the receiver's executable file.
ja: レシーバの持つ実行ファイルの完全パス名。

source: The full pathname of the receiver's subdirectory containing plug-ins.
ja: このレシーバの、プラグインを含んでいる下位ディレクトリの完全パス名。

source: The full pathname of the receiver’s bundle directory.
ja: レシーバの持つバンドルディレクトリの完全パス名。

source: The fully-qualified container identifier for an iCloud container directory.
ja: あるiCloudコンテナディレクトリに対する完全修飾コンテナ識別子。

source: The function iterates over the elements of table, and for each one appends the string returned by the describe callback function.
ja: 関数はtableの要素すべてにわたって反復します、そしてそれぞれのものに対してdescribeコールバック関数によって返される文字列を付加します。

source: The function iterates over the key-value pairs of table and for each one appends the string “a
ja: 関数はtableのキー値ペアのすべてにわたって反復します、そしてそれぞれのものに対して文字 “a = b;\n” を付加します。

source: The function pointers used to configure behavior of NSMap Table with respect to key elements within a map table.
ja: マップテーブル内のキー要素に関して、NSMap Tableの挙動を設定するのに使われる関数ポインタ。

source: The function pointers used to configure behavior of NSMap Table with respect to value elements within a map table.
ja: マップテーブル内の値要素に関して、NSMap Tableの挙動を設定するのに使われる関数ポインタ。

source: The fundamental matching method for NSRegular Expression is a Block iterator method that allows clients to supply a Block object which will be invoked each time the regular expression matches a portion of the target string.
ja: NSRegular Expressionの基本的なマッチングメソッドは「ブロック」イテレータメソッド（反復子メソッド）です、それは、正規表現が目標文字列のある部分にマッチするたびに呼び出される「ブロック」オブジェクトをクライアントが提供できるようにします。

source: The garbage collector invokes this method on the receiver before disposing of the memory it uses.
ja: ガベージコレクションは、このメソッドをレシバー上で、それが使うメモリの処分を行う前に発動します。

source: The general best practice of weak linking using the responds(to:) method cannot be used here.
ja: 一般的に最良の慣行であるresponds(to:)メソッドを使う弱いリンクは、ここで使うことはできません。

source: The general pattern for using a bundle object is as follows:
ja: バンドルオブジェクトの使用の一般的なパターンは、以下の通りです：

source: The general semantics follow those of the enumerate Dates function.
ja: おおまかな意味論は、enumerate Dates関数に従います。

source: The graphic intersection of a Rect and b Rect.
ja: a Rectとb Rectの画像交差。

source: The greatest representable value that is less than this decimal.
ja: 表現可能な最も大きい値で、この10進数と比較してより小さいもの。

source: The group ID is set to that of the parent directory.
ja: グループIDは、親ディレクトリのそれに設定されます。

source: The group of methods that are fundamental to all Objective-C objects.
ja: 全てのObjective-Cオブジェクトにとって基本的なメソッドのグループ。

source: The hash value for the data.
ja: データに対するハッシュ値。

source: The hashing function must be defined such that if two data elements are equal, as defined by the comparison function, the values produced by hashing on these elements must also be equal.
ja: ハッシュ関数はこのように定義されなければなりません、もし２つのデータ要素が、比較関数によって定義されるように等しいならば、それら要素上でハッシュ化されることによって生成される値もまた等しくなければなりません。

source: The header fields used to create the NSHTTPCookie objects.
ja: NSHTTPCookieオブジェクトを作成するのに使われるヘッダフィールド。

source: The height of a Rect.
ja: a Rectの高さ。

source: The help string or nil if the application does not have a Help .plist file or the file does not contain an entry for the specified key.
ja: ヘルプ文字列、またはnil、もしアプリケーションがHelp .plistファイルを持たない、または指定されたkeyに対してファイルが何ら登録項目を含まないならば。

source: The hint is computed by sorted Array Hint in O(N) (where N is the number of items).
ja: このヒントはsorted Array HintによってO(N)で計算されます（ここでNは項目の数です）。

source: The hint is simply an array of size N containing the N hashes.
ja: このヒントは単に大きさNの配列でN個のハッシュを含んでいます。

source: The host app context from which an app extension is invoked.
ja: それからアプリ拡張が発動される、ホストアプリ前後関係。

source: The host for address.
ja: addressに対するホスト。

source: The host named hostname.
ja: hostnameの名前を持つホスト。

source: The icon that represents the file wrapper.
ja: ファイルラッパーを表すアイコン。

source: The identifier for an existing NSBundle instance.
ja: 既存のNSBundleインスタンスに対する識別子。

source: The identifier of the calendar.
ja: カレンダーの識別子。

source: The index at which to start the resulting subsequence.
ja: それで結果の下位シーケンスが始まるインデックス。

source: The index of the element in the array.
ja: 配列の中の要素のインデックス。

source: The index of the first element for which predicate returns true.
ja: それに対してpredicateがtrueを返す最初の要素のインデックス。

source: The index of the first element in the reordered collection that matches belongs In Second Partition.
ja: 並べ直されたコレクションの中の最初の要素のインデックス、それはbelongs In Second Partitionに合致します。

source: The index of the first node in the index path.
ja: インデックスパスの最初のノードの値。

source: The index of the first value to swap.
ja: 交換する１つ目の値のインデックス。

source: The index of the last element to include in the resulting subsequence.
ja: 結果の下位シーケンスの中に含まれることになる最後の要素のインデックス。

source: The index of the second value to swap.
ja: 交換する２つ目の値のインデックス。

source: The index whose corresponding value in the array passes the test specified by predicate and opts.
ja: それの対応する配列の中の値がpredicateによって指定されるテストそしてoptsを合格するインデックス。

source: The indexes of the objects over which to enumerate.
ja: それらを１つ１つ列挙していくことになるいくらかのオブジェクトのインデックス。

source: The indexes whose corresponding values in the array pass the test specified by predicate.
ja: predicateによって指定されるテストを合格した配列の中のいくらかの対応する値のインデックス。

source: The indices that are valid for subscripting the collection, in ascending order.
ja: コレクションの添え字に使うのに有効である、昇順でのインデックス。

source: The initialized Apple event (an instance of NSApple Event Descriptor), or nil if an error occurs.
ja: 初期化されたアップルイベント（NSApple Event Descriptorのインスタンス）、またはエラーが起こるならばnil。

source: The initialized Apple event record, or nil if an error occurs.
ja: 初期化されたアップルイベントレコード、またはエラーが起こるならばnil。

source: The initialized cookie object.
ja: 初期化されたクッキーオブジェクト。

source: The initialized file handle object or nil if no file exists at path.
ja: 初期化されたファイルハンドルオブジェクトまたは、pathでファイルが存在しないならばnil。

source: The initialized file handle object or nil if no file exists at url.
ja: 初期化されたファイルハンドルオブジェクトまたは、ファイルがurlで存在しないならばnil。

source: The initialized object takes responsibility for calling the AEDispose Desc function on the AEDesc at object deallocation time.
ja: 初期化されたオブジェクトは、オブジェクトの割り当て解除時にAEDesc上で呼び出しているAEDesc関数に対する責任を取ります。

source: The initialized script object, nil if an error occurs.
ja: 初期化されたスクリプトオブジェクト、エラーが起こるならばnil。

source: The initializer populates a Coordinate instance by using methods on the Decoder instance it receives as a parameter.
ja: このイニシャライザは、それがパラメータとして受け取るDecoderインスタンス上でメソッドを使うことでCoordinateインスタンスを満たします。

source: The instance of NSData that you wish to wrap.
ja: あなたがラップすることを願うNSDataのインスタンス。

source: The integer to convert.
ja: 変換する整数。

source: The integer value to be stored in the returned descriptor.
ja: 返される記述子の中に格納される整数値。

source: The intent is that the same matches as for a .forward search will be found (that is, if you are enumerating forwards or backwards for each hour with minute “27”, the seconds in the date you will get in forwards search would obviously be 00, and the same will be true in a backwards search in order to implement this rule.
ja: 意図としては、.forward検索に対するのと同じ合致するものが見つけられることです（すなわち、あなたが前方または後方に “27” 分を持つ各一時間を列挙しているならば、あなたが前方検索で得る日付の中の秒数は当然ながら00になるでしょう、そして同じことは後方検索においてこの規則を実装するために当てはまります。

source: The intent is to return a date on the same day as the original date argument.
ja: その意図は、元の日付引数と同じ日にち上での日付を返すことです。

source: The interface a file coordinator uses to inform an object presenting a file about changes to that file made elsewhere in the system.
ja: あるファイルを表しているオブジェクトに、そのファイルにシステムのどこか他で為される変更について告知するために、ファイルコーディネータが使うインターフェイス。

source: The interface a file manager's delegate uses to intervene during operations or if an error occurs.
ja: オペレーションの間にまたはエラーが起こる場合に介入するために、ファイルマネージャの委任先が使うインターフェイス。

source: The interface a net service browser uses to inform a delegate about the state of service discovery.
ja: サービス発見の状態を委任先に知らせるためにネットサービスブラウザが使うインターフェイス。

source: The interface a net service uses to inform its delegate about the state of the service it offers.
ja: それが提示するサービスの状態をそれの委任先に知らせるためにネットサービスが使うインターフェイス。

source: The interface an XML parser uses to inform its delegate about the content of the parsed document.
ja: 構文解析された文書の内容を委任先に知らせるためにXMLパーサが使うインターフェイス。

source: The interface an app extension uses to respond to a request from a host app.
ja: ホストアプリからの要求に応答するためにアプリ拡張が使うインターフェイス。

source: The interface through which a user activity instance notifies its delegate of updates.
ja: それを通してユーザ活動インスタンスがそれの更新の委任先を通知するインターフェイス。

source: The intersection of [member] and the set, if the intersection was nonempty; otherwise, nil.
ja: [member]とこの集合の交叉、その交叉が空でなかったならば；そうでなければ、nil。

source: The intersection of [new Member] and the set if the intersection was nonempty; otherwise, nil.
ja: [new Member]とこの集合の交叉、その交叉が空でなかったならば；そうでなければ、nil。

source: The interval between 00:00:00 UTC on 1 January 2001 and the current date and time.
ja: 00:00:00 UTC 1 January 2001と現在の日付と時刻との間の隔たり。

source: The interval between the date value and 00:00:00 UTC on 1 January 1970.
ja: 日付値と00:00:00 UTC 1 January 1970の間の隔たり。

source: The interval between the date value and 00:00:00 UTC on 1 January 2001.
ja: 日付値と00:00:00 UTC 1 January 2001の間の隔たり。

source: The interval between the receiver and the another parameter.
ja: レシーバとanotherパラメータの間の隔たり。

source: The invocation to forward.
ja: この呼び出しを転送します。

source: The item containing the content you want to replace.
ja: あなたが置き換えるのを望む内容を含んでいる項目。

source: The item containing the new content for original Item URL.
ja: original Item URLに対する新しい内容を含んでいる項目。

source: The item could not be uploaded to iCloud because it would make the account go over its quota.
ja: 項目は、iCloudにアップロードされることができませんでした、それはアカウントにそれの割り当てを越えさせるからです。

source: The item has not been uploaded to iCloud by another device yet.
ja: 項目は、別のデバイスによってまだiCloudにアップロードされ終わっていません。

source: The item to move to the trash.
ja: ゴミ箱に移動する項目。

source: The iterator will increment byte-by-byte.
ja: イテレータは、「バイト毎」に漸増します。

source: The joined sequence of elements.
ja: つなぎ合わされたシーケンス要素。

source: The joule unit.
ja: ジュール単位。

source: The key in a file attribute dictionary whose value indicates the file's HFS creator code.
ja: ファイル属性辞書の中のキー、それの値はファイルのHFSクリエーターコードを指し示します。

source: The key in a file attribute dictionary whose value indicates the file's HFS type code.
ja: ファイル属性辞書の中のキー、それの値はファイルのHFSタイプコードを指し示します。

source: The key in a file attribute dictionary whose value indicates the file's Posix permissions.
ja: ファイル属性辞書の中のキー、それの値はファイルのPosix権限を指し示します。

source: The key in a file attribute dictionary whose value indicates the file's creation date.
ja: ファイル属性辞書の中のキー、それの値はファイルの作成日を指し示します。

source: The key in a file attribute dictionary whose value indicates the file's filesystem file number.
ja: ファイル属性辞書の中のキー、それの値はファイルのファイルシステムファイルナンバーを指し示します。

source: The key in a file attribute dictionary whose value indicates the file's group ID.
ja: ファイル属性辞書の中のキー、それの値はファイルのグループIDを指し示します。

source: The key in a file attribute dictionary whose value indicates the file's last modified date.
ja: ファイル属性辞書の中のキー、それの値はファイルの最終修正日を指し示します。

source: The key in a file attribute dictionary whose value indicates the file's owner's account ID.
ja: ファイル属性辞書の中のキー、それの値はファイルの所有者のアカウントIDを指し示します。

source: The key in a file attribute dictionary whose value indicates the file's reference count.
ja: ファイル属性辞書の中のキー、それの値はファイルの参照カウントを指し示します。

source: The key in a file attribute dictionary whose value indicates the file's size in bytes.
ja: ファイル属性辞書の中のキー、それの値はファイルのサイズをバイトで指し示します。

source: The key in a file attribute dictionary whose value indicates the file's type.
ja: ファイル属性辞書の中のキー、それの値はファイルの型を指し示します。

source: The key in a file attribute dictionary whose value indicates the group name of the file's owner.
ja: ファイル属性辞書の中のキー、それの値はファイルの所有者のグループ名を指し示します。

source: The key in a file attribute dictionary whose value indicates the identifier for the device on which the file resides.
ja: ファイル属性辞書の中のキー、それの値はファイルが帰するデバイスに対する識別子を指し示します。

source: The key in a file attribute dictionary whose value indicates the name of the file's owner.
ja: ファイル属性辞書の中のキー、それの値はファイルの所有者の名前を指し示します。

source: The key in a file attribute dictionary whose value indicates whether the file is busy.
ja: ファイル属性辞書の中のキー、それの値はファイルがビジーかどうかを指し示します。

source: The key in a file attribute dictionary whose value indicates whether the file is mutable.
ja: ファイル属性辞書の中のキー、それの値はファイルが可変かどうかを指し示します。

source: The key in a file attribute dictionary whose value indicates whether the file is read-only.
ja: ファイル属性辞書の中のキー、それの値はファイルが読み込み専用かどうかを指し示します。

source: The key in a file attribute dictionary whose value indicates whether the file's extension is hidden.
ja: ファイル属性辞書の中のキー、それの値はファイルの拡張子が隠されるかどうかを指し示します。

source: The key in a file system attribute dictionary dictionary whose value indicates the filesystem number of the file system.
ja: ファイル属性辞書の辞書の中のキー、それの値はファイルシステムのファイルシステムナンバーを指し示します。

source: The key in a file system attribute dictionary dictionary whose value indicates the number of free nodes in the file system.
ja: ファイル属性辞書の辞書の中のキー、それの値はファイルシステムの中のフリーノードの数を指し示します。

source: The key in a file system attribute dictionary whose value indicates the amount of free space on the file system.
ja: ファイル属性辞書の中のキー、それの値はファイルシステムの空き容量を指し示します。

source: The key in a file system attribute dictionary whose value indicates the number of nodes in the file system.
ja: ファイル属性辞書の中のキー、それの値はファイルシステムの中のフリーノードの数を指し示します。

source: The key in a file system attribute dictionary whose value indicates the size of the file system.
ja: ファイル属性辞書の中のキー、それの値はファイルシステムのサイズを指し示します。

source: The key path, relative to the array, of the property to observe.
ja: 監視するプロパティのキーパス、この配列に相対的に。

source: The key path, relative to the object receiving this message, of the property to observe.
ja: 監視するプロパティのキーパス、このメッセージに関係しているオブジェクトに相対的に。

source: The keys for obtaining error information, such as error Message, are described in the Constants section.
ja: 入手されるエラー情報に対するキー、例えばerror Messageなどは、「定数」の節で記述されます。

source: The keys for the to-one relationship properties of the receiver, if any.
ja: レシーバの対一関係プロパティに対するキーを格納している配列。

source: The keys in the dictionary are described in File Attribute Keys.
ja: 辞書の中のキーは、File Attribute Keysにおいて記述されます。

source: The keys in this dictionary are the header field names, as received from the server.
ja: この辞書の中のキーは、サーバーから受け取ったままの、ヘッダフィールド名です。

source: The keys that can appear in the change dictionary.
ja: 変更辞書において現れることができるキー。

source: The keyword (a four-character code) for the descriptor at the one-based location specified by an Index, or 0 if an error occurs.
ja: an Indexによって指定される１起点位置での記述子に対するキーワード（４文字コード）、またはエラーが起こるならば０。

source: The kilocalorie unit.
ja: キロカロリー単位。

source: The kilojoule unit.
ja: キロジュール単位。

source: The kind of calendar to use.
ja: 使用するカレンダーの種類。

source: The kinds of available calendars.
ja: 利用可能なカレンダーの種類。

source: The kinds of changes that can be observed.
ja: 監視されることが可能である、変更の種類。

source: The kinds of mutation that you can make to an unordered collection.
ja: あなたが順不同コレクションにすることができる、変化の種類。

source: The language in which to speak the accessibility element's label, value, and hint.
ja: それによってアクセシビリティ要素のラベル、値、そしてヒントを音声で語ることになる言語。

source: The larger calendar component.
ja: より大きいカレンダー構成要素。

source: The largest x coordinate value within a Rect.
ja: a Rect内部の最大のx座標を返します。

source: The largest y coordinate value within a Rect.
ja: a Rect内部の最大のy座標を返します。

source: The last element of the collection if the collection has one or more elements; otherwise, nil.
ja: コレクションが１つ以上の要素を持つならばコレクションの最後の要素；そうでなければnil。

source: The last element of the collection.
ja: コレクションの最後の要素。

source: The last integer in self, or nil if self is empty.
ja: selfの中の最後の整数、またはselfが空ならばnil。

source: The last object in the array.
ja: この配列の最後のオブジェクト。

source: The last path component is used as the name of the link.
ja: 最後のパス構成要素は、リンクの名前として使われます。

source: The last path component of the URL issued as the name of the link.
ja: URLの最後のパス構成要素は、リンクの名前として支給されます。

source: The latency between posting the notification and the notification’s arrival in another task is unbounded.
ja: 通知の投函と、別タスクでの通知到着との間の待ち時間は、限界がありません。

source: The leading zero is required; it distinguishes Octal constants from back references.
ja: 先頭のゼロは必要です；それは、８進の定数と前方参照を区別します。

source: The least representable value that is greater than this decimal.
ja: 表現可能な最も小さい値で、この10進数と比較してより大きいもの。

source: The left operand is greater than the right operand.
ja: 左の演算数は、右の演算数より大きい。

source: The left operand is smaller than the right operand.
ja: 左の演算数は、右の演算数より小さい。

source: The length of possible strings matched by the look-behind pattern must not be unbounded (no * or + operators.)
ja: 後方指定パターンによってマッチされる可能な文字列の長さは、限界がなければなりません（*または+演算子は不可）。

source: The length of the data is limited to the buffer size of the underlying operating system.
ja: データの長さは、基底オペレーティングシステムのバッファサイズに制限されます。

source: The length, in bytes, of the data to be set in the returned descriptor.
ja: 返される記述子の中に設定されるデータの、バイトでの長さ。

source: The list indices are one-based.
ja: このリストインデックスは、１起点です。

source: The list of ports for the cookie, returned as an array of NSNumber objects containing integers.
ja: クッキーに対するポートのリスト、整数を含むNSNumberオブジェクトからなる配列として返されます。

source: The load status of a bundle.
ja: バンドルのロードステータス。

source: The locale for the receiver.
ja: レシーバに対するロケール。

source: The locale for which the template is required.
ja: 雛形が必要とされるロケール。

source: The locale of the calendar.
ja: カレンダーのロケール。

source: The locale to use when formatting date and time values.
ja: 日付と時刻値を書式設定する時に使うロケール。

source: The localization for the development language.
ja: 開発言語のローカライゼーション。

source: The localized value of a key is returned when one is available.
ja: あるキーのローカライズされた値は、それが利用可能である時に返されます。

source: The location of a file containing a string representation of an array produced by the write(to: atomically:) method.
ja: write(to: atomically:)メソッドによって生成される配列の文字列表現を含んでいるファイルの記憶場所。

source: The location of a file containing a string representation of an array produced by the write To URL: atomically: method.
ja: write To URL: atomically:メソッドによって生成される配列の文字列表現を含んでいるファイルの記憶場所。

source: The location of a previous revision of the contents being written.
ja: 書き出される内容の前の修正版の場所。

source: The location to write the data into.
ja: データをそれへと書き込む位置。
